# Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль.
# Проверьте его работу на данных, вводимых пользователем.
# При вводе пользователем нуля в качестве делителя программа должна корректно обработать эту ситуацию и не завершиться с ошибкой.

class ZeroError(Exception):
    def __init__(self, error):
        self.error = error


try:
    a, b = [int(i) for i in input("Введите числа через пробел: ").split()]
    if b == 0:
        raise ZeroError('Деление на ноль невозможно')
except ZeroError as err:
    print(err)
