# 1. Реализовать класс Matrix (матрица).
# Обеспечить перегрузку конструктора класса (метод __init__()), который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц). Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:
    def __init__(self, matrix):
        self.matrix = matrix

    def __str__(self):
        return '\n'.join([''.join(['%d\t' % i for i in el]) for el in self.matrix])

    def __add__(self, other):
        res = []
        num = []
        for i in range(len(self.matrix)):
            for ii in range(len(self.matrix[0])):
                summa = other.matrix[i][ii] + self.matrix[i][ii]
                num.append(summa)
                if len(num) == len(self.matrix):
                    res.append(num)
                    num = []
        return Matrix(res)


a = Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
b = Matrix([[11, 12, 13], [14, 15, 16], [17, 18, 19]])
print(a)
print(b)
print(a+b)
