# Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count
from itertools import cycle
from random import randrange

my_cycle = [el for el in range(1, 6)]
new_lst = []
for i, el in enumerate(cycle(my_cycle)):
    new_lst.append(el)
    if i > 10:
        print(new_lst)
        break

new_lst_2 = []
for i in count(2):
    new_lst_2.append(i)
    if i > 10:
        print(new_lst_2)
        break
