# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
# Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.

def func(hours, rate, bonus):
    salary = hours * rate + bonus
    return salary


print(func(int(input('Введите выработку в часах: ')), int(input('Введите ставку в час: ')), int(input('Введите премию: '))))
