# Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
# Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.

# Через if

def func(a, b):
    if b == 0:
        print('Пожалуйства, введите переменную не равную нулю.')
    else:
        c = a / b
        return c


print(func(int(input('Введите первую переменную: ')), int(input('Введите вторую переменную: '))))

# Через try


def func(a, b):
    try:
        c = a / b
    except ZeroDivisionError:
        print('Пожалуйства, введите переменную не равную нулю.')
    else:
        return c


print(func(int(input('Введите первую переменную: ')), int(input('Введите вторую переменную: '))))