# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.

def func(a, b):
    c = 0
    d = 1
    for i in range(abs(b)):
        d *= a
        c += 1
    return d


print(func(int(input('Введите первую переменную: ')), int(input('Введите вторую переменную: '))))
