# Программа запрашивает у пользователя строку чисел, разделенных пробелом. При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу.

lst = (input('Введите переменные через пробел: ')).split()
for i, item in enumerate(lst):
    lst[i] = int(item)
print(sum(lst))
while True:
    a = input('Хотители ли вы еще ввести числа? (да/нет) ')
    if a == 'да':
        lst.extend((input('Введите переменные через пробел: ')).split())
        for i, item in enumerate(lst):
            lst[i] = int(item)
    else:
        print(sum(lst))
        break
    print(sum(lst))


