# Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
# Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
# Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * число см толщины полотна.
# Проверить работу метода.

# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:
    def __init__(self, length, width):
        self._length = length
        self._width = width
        self._width_2 = 25
        self._length_2 = 5

    def asphalt(self):
        asphalt_width = self._length * self._width * self._width_2 * self._length_2 / 1000
        print(f'Для покрытия всего дорожного полотна неободимо {asphalt_width} массы асфальта')


a = Road(5000, 20)
a.asphalt()
