# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
# практических и лабораторных занятий по этому предмету и их количество. Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр)
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

with open('for_task_6.txt', 'r', encoding='utf-8') as f:
    lines = f.readlines()
    subj = {}
    for line in lines:
        for line_2 in lines:
            new_lst = []
            lst = line.replace('(', ' ').split()
            for i in lst:
                if i.isdigit():
                    new_lst.append(int(i))
            break
        s = sum(new_lst)
        subj[lst[0]] = s
    print(subj)

